beauty-solutions-yii/controllers/TransaksiPembelianController.php

INSERT INTO `transaksi_pembelian` (`id_owner`, `id_distributor`, `jumlah_bayar`, `tanggal`) VALUES (2147483647, 1, 100000, '2024-12-21 16:44:10')
---
    public function actionCreate()
    {
        $transaksi_pembelian = new TransaksiPembelian();

        if ($this->request->isPost) {
            $postData = $this->request->post('TransaksiPembelian');
            $jumlahBarangMasuk = $this->request->post('jumlah_barang_masuk');
            $idBarang = $this->request->post('id_barang');
            // $idPembelian = $this->request->post('id_pembelian');
            // Prepare data for the main table (TransaksiPembelian)
            $transaksi_pembelian->id_owner=$postData['id_owner'];
            $transaksi_pembelian->id_distributor= $postData['id_distributor'];
            $transaksi_pembelian->jumlah_bayar= $postData['jumlah_bayar'];
            $transaksi_pembelian->tanggal= date('Y-m-d H:i:s');
            $result = $transaksi_pembelian->save();

INSERT INTO `detail_pembelian` (`id_pembelian`, `id_barang`, `jumlah_barang_masuk`, `harga_beli`) VALUES (25, 2, 1000, 100)
---
                    $detail_pembelian->jumlah_barang_masuk = $jumlahBarangMasuk;
                    $detail_pembelian->harga_beli = (int) $transaksi_pembelian->jumlah_bayar / (int) $jumlahBarangMasuk;
                    // dd($detail_pembelian);
                    $detail_pembelian->save();

SELECT `id`, `nama` FROM `barang`
---
        }

        // Render the view and pass the main model
         $barang= Barang::find()
        ->select(['id','nama'])
        ->asArray()
        ->all();

SELECT * FROM `transaksi_pembelian` WHERE `id`='26'
---
    protected function findModel($id)
    {
        if (($model = TransaksiPembelian::findOne(['id' => $id])) !== null) {